## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/89309e48-6231-40f6-84e4-2f42b4a0bb33/terraform-bin show -no-color main.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.acr.azurerm_container_registry.acr has been deleted
  - resource "azurerm_container_registry" "acr" {
      - id                            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks" -> null
        name                          = "devacrvelidaaks"
        tags                          = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acr_pull_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/9c473a98-2b2b-12ed-a70c-1f94c183c5aa" -> null
        name                                   = "9c473a98-2b2b-12ed-a70c-1f94c183c5aa"
        # (9 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.aks has been deleted
  - resource "azurerm_kubernetes_cluster" "aks" {
      - id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks" -> null
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
        name                                = "dev-velidaaks"
        tags                                = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (33 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace has been deleted
  - resource "azurerm_monitor_workspace" "workspace" {
      - id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks" -> null
      - name                                = "dev-amw-velidaaks" -> null
        tags                                = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (6 unchanged attributes hidden)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks/providers/Microsoft.Authorization/roleAssignments/a80cd7f9-9a4c-c6fa-e1f9-e5f6acafbef1" -> null
        name                                   = "a80cd7f9-9a4c-c6fa-e1f9-e5f6acafbef1"
        # (9 unchanged attributes hidden)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana has been deleted
  - resource "azurerm_dashboard_grafana" "grafana" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks" -> null
        name                                   = "dev-grafana-velidaaks"
        tags                                   = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (12 unchanged attributes hidden)

      - identity {
          - principal_id = "faaef024-6b78-443e-80be-fe8e3a544721" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/cbb566dd-8920-c644-1732-2e6e4b4233bf" -> null
        name                                   = "cbb566dd-8920-c644-1732-2e6e4b4233bf"
        # (9 unchanged attributes hidden)
    }

  # module.ssh-key.azapi_resource.ssh_public_key has been deleted
  - resource "azapi_resource" "ssh_public_key" {
      - id                        = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie" -> null
        name                      = "sshtruecollie"
        # (9 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi has been deleted
  - resource "azurerm_user_assigned_identity" "msi" {
      - id                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks" -> null
        name                = "dev-uai-velidaaks"
      - principal_id        = "d6a7ec3c-2cb6-4a37-91fb-b3c9c83fff47" -> null
        tags                = {
            "application" = "velidaaks"
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "australiaeast"
      + login_server                  = (known after apply)
      + name                          = "devacrvelidaaks"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-velidaaks"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # module.acr_pull_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "dev-velidaaks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "dev-velidaaks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-velidaaks"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2s_v3"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity (known after apply)

      + linux_profile {
          + admin_username = "willvelida"

          + ssh_key {
              + key_data = (known after apply)
            }
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip          = (known after apply)
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "kubenet"
          + network_policy          = (known after apply)
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = (known after apply)
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)

      + workload_autoscaler_profile {
          + keda_enabled                              = true
          + vertical_pod_autoscaler_controlled_values = (known after apply)
          + vertical_pod_autoscaler_enabled           = false
          + vertical_pod_autoscaler_update_mode       = (known after apply)
        }
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be updated in-place
  ~ resource "azurerm_monitor_data_collection_rule" "dcr" {
        id                          = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks"
        name                        = "MSProm-australiaeast-dev-velidaaks"
        tags                        = {}
        # (6 unchanged attributes hidden)

      ~ destinations {
          ~ monitor_account {
              ~ monitor_account_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks" -> (known after apply)
                name               = "dev-amw-velidaaks"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {
      + data_collection_rule_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks"
      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"
      + id                      = (known after apply)
      + name                    = "dcra-dcr-prometheus-aks"
      + target_resource_id      = (known after apply)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created
  + resource "azurerm_monitor_workspace" "workspace" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "dev-amw-velidaaks"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "rg-velidaaks"
      + tags                                = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
        }
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = (known after apply)
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ef4778b-9110-4e3b-8390-6ab10d2f1607"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "australiaeast"
      + name                                   = "dev-grafana-velidaaks"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "rg-velidaaks"
      + sku                                    = "Standard"
      + tags                                   = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.network_contributor_role.azurerm_role_assignment.role must be replaced
-/+ resource "azurerm_role_assignment" "role" {
      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/25834415-b824-1ec4-16be-bd801e32fb23" -> (known after apply)
      ~ name                                   = "25834415-b824-1ec4-16be-bd801e32fb23" -> (known after apply)
      ~ principal_id                           = "d6a7ec3c-2cb6-4a37-91fb-b3c9c83fff47" -> (known after apply) # forces replacement
      ~ role_definition_id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.resource-group.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks"
        name       = "rg-velidaaks"
      ~ tags       = {
            "application" = "velidaaks"
            "environment" = "dev"
          + "location"    = "australiaeast"
            "owner"       = "willvelida"
        }
        # (2 unchanged attributes hidden)
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "dev-velidaaks"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "KubernetesRecordingRulesRuleGroup-dev-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "dev-velidaaks"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "NodeRecordingRulesRuleGroup-dev-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

  # module.ssh-key.azapi_resource.ssh_public_key will be created
  + resource "azapi_resource" "ssh_public_key" {
      + body                      = jsonencode({})
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "australiaeast"
      + name                      = "sshtruecollie"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"
    }

  # module.ssh-key.azapi_resource_action.ssh_public_key_gen must be replaced
-/+ resource "azapi_resource_action" "ssh_public_key_gen" {
      ~ id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie/generateKeyPair" -> (known after apply)
      ~ output                 = {
          - privateKey = <<-EOT
                -----BEGIN RSA PRIVATE KEY-----
                MIIG5QIBAAKCAYEAryiF9IOVE/+/ps4134gHfk0Z/0yrs6A1384R343PG+PM/XYk
                H8T6QfRCd5QADdoGwNYN0fAlMkam+1XSiDAGZWJTs5qwLA2NmMPWXw9so5wJaa1s
                g+rT/BNJzfixkMt3Ryq9sHhlIGQk/n8xTWejuKs/2eIR9DENm4QhODhk10c/0ULC
                MNYVreVj3LHaT+kVGXqpb5ADNNkENCLA9R6sqmhjLPQ6YNeKjU+CZmlX6sEt6pBh
                59ezeAs6FhgF8puV5cHTFcs02izP/ytxLCUA2tD1TsjqG689e+25YWF9DmQhyfVx
                /sbetQV8UDuza4Jn5gbOHaj/riiareZU/+lKh/uIydFJLpXz5rX+4EuVfNurOFAs
                kxGQ9AxGrAB+dzp698/IQlz2LEg2ck5VBDfbozNhcbTACHKsv++ujI+bTGvKJaVc
                DuUhS9/6gA8x3lfhwpd9illd6eUip1lb6/pOuj+AdgSYZFQ/SzO5Wu9l8ai4S437
                AiyN2KbGegORk/zJAgMBAAECggGADN/MoME/Jt4oZwlHGmv0KQtfus0W3bgL3axW
                0fipXWJsAcE6PH+M6WYbsJBXRK1ey7OwBltBUKWyxkxzkgD9p1wHzO60vjgszSqv
                ygLnOEtSwcq2bCfJdwCv7wy1eHAMD1YL5TmkLTJPKcmNhSP1+6/SnKAqM6mbV2/p
                xSkX+F7LSQVAIrjJlSOEKIeGBVObcmj6pTGPmsXMskxPpHShulC74WT+GXoeO+65
                Je/eP2n9hv0fxRusnEku9srDPSbESYHdc9qATa8WXt2UOtBOUjb2of3BIx+fALAy
                8EPjYC21u7axkR4GP6R0eoIQzEkWpC9O4wEEY5dhFPE930zPjIFLg6Ob792hUxTn
                y4dXNlcxT5ewFEm/YfRAn/wl/6zuP920hDRh1oF0MID3E3f+V8h5SDh2iEucEbv1
                M5J67GQ+41yR1AnNVBIgf42O4kkz6YxoFFLxSwbae6o2efONO/evtxyWmmw3vrju
                nFLM6js3aHlctl78GYRwKEYMA88FAoHBAOfzYwRO6nRNd1F3hH3jstIan9irQQqp
                4SU5C/Nj9SpD+0qPVwmajb+6tvrObnnH2+cXrcc06ViVZKhjsQrQxKif6WxDVf0G
                EcQkAOvKLVEX+A871fzBvd3zelWJ4cUZt7Lc2LZzBcLItATY17PD2fAxwUWTgvHu
                Noa+iqnXuT+2LCT8JfvwAU8CqqQ8zK9Ul8qw0SbEzH/rcf+xvLENT4nc3n1dafI5
                g7q4XT4hM/ZTkNuSU6gTNYDWxfYhQvptmwKBwQDBUbVU0qSg5VlRmuNcAtomZ72F
                nRh3Eoiyy6fuWFJe1UYLGDuZTpNNDOdLnoTAvCUlQSAbyU+lQHtApMT8ILcfCLcS
                WPyg0VkW0CANGr6Md4+5XlVrU52IKmlecne3VwclfU4mTkZajH47OoVQ7YGhozyK
                oqj8QZX8ZHtVlPC5eaeW7lfJ9K4oXbvCoMmi3VUx+MMz2tihSqf29qQp+JKWAMGa
                drpt6lyY5V3aTI/H/Mr7PESs9+RM8TwoyE3B12sCgcEApQNhzg7WfScfW7XLbEQx
                U4fdcCdlflCc+/45ok3afNcgT0rqgMqTTXNn+cYikkC9EQqndrEN0Rd3JNTHfwpG
                3i/lwD+nTPqkaQW0IgsTcj27HBtVgRvUF7K/tVsCY1aIeZbkFeh+kLR4XXpm+ly7
                D0ZWWUk4PyVZZULpIyt1fv37KdS4sSNtyuf6vh0DATkNRAXGxe38DoVR9LZdpxfx
                HgMjxcxPMyP3sz62Fx1H+lY5F/xhx5Di32XsL845+C9BAoHBAJaIYYLjY35GGP8K
                dPA46FXvggyA/4P40qknHGTkMX/W4uvQutft75WX7qNblFPgLayMwcvhPjuXsmHr
                69fIQc/QoX2P/WfcnFq/RbXulWIb17aoVit0uL5HCDWbPM1u3wm6QRhi6zWnIMRO
                FXGm/8I1sfbiImQLThdyxvclOy2yJWXJwmJoPRUBqCstuNUxNB3tb1L5nqY51ADi
                nYJxJPPZMuhse08Lp38HW8WYyH0Zw5VOoMtvXD7tucKn9qRycQKBwQCxkAgmQhcv
                mfTiYtLY5l6wE8pB/wL3Uq9dBBhc796wSg70utNWQVBrnorHkQEyzH+R7MnInYaU
                7OVGGVckEDLbT8KL5R9+0ioFPmU9oeC2Xp6JDKojNNqh/IEifAeWaFBK04AYXj3j
                G7vvqk4GGGE6sKjuX1WxB0BO1PFSYcQ25iAIZJyJLcwMvjXvUQ4pfUXhWinC2acp
                DUc9gcspsCAumOZxoNEU9SSrbqGH3MsgQWjZ7htdoia/DFGnvBLj4BI=
                -----END RSA PRIVATE KEY-----
            EOT
          - publicKey  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvKIX0g5UT/7+mzjXfiAd+TRn/TKuzoDXfzhHfjc8b48z9diQfxPpB9EJ3lAAN2gbA1g3R8CUyRqb7VdKIMAZlYlOzmrAsDY2Yw9ZfD2yjnAlprWyD6tP8E0nN+LGQy3dHKr2weGUgZCT+fzFNZ6O4qz/Z4hH0MQ2bhCE4OGTXRz/RQsIw1hWt5WPcsdpP6RUZeqlvkAM02QQ0IsD1HqyqaGMs9Dpg14qNT4JmaVfqwS3qkGHn17N4CzoWGAXym5XlwdMVyzTaLM//K3EsJQDa0PVOyOobrz177blhYX0OZCHJ9XH+xt61BXxQO7NrgmfmBs4dqP+uKJqt5lT/6UqH+4jJ0UkulfPmtf7gS5V826s4UCyTEZD0DEasAH53Onr3z8hCXPYsSDZyTlUEN9ujM2FxtMAIcqy/766Mj5tMa8olpVwO5SFL3/qADzHeV+HCl32KWV3p5SKnWVvr+k66P4B2BJhkVD9LM7la72XxqLhLjfsCLI3YpsZ6A5GT/Mk= generated-by-azure"
        } -> (known after apply)
      ~ resource_id            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "dev-uai-velidaaks"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-velidaaks"
      + tags                = {
          + "application" = "velidaaks"
          + "environment" = "dev"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
        }
      + tenant_id           = (known after apply)
    }

Plan: 15 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ kube_config         = (sensitive value)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.acr.azurerm_container_registry.acr has been deleted%0A  - resource "azurerm_container_registry" "acr" {%0A      - id                            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks" -> null%0A        name                          = "devacrvelidaaks"%0A        tags                          = {%0A            "application" = "velidaaks"%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.acr_pull_role.azurerm_role_assignment.role has been deleted%0A  - resource "azurerm_role_assignment" "role" {%0A      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/9c473a98-2b2b-12ed-a70c-1f94c183c5aa" -> null%0A        name                                   = "9c473a98-2b2b-12ed-a70c-1f94c183c5aa"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks has been deleted%0A  - resource "azurerm_kubernetes_cluster" "aks" {%0A      - id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks" -> null%0A      - kube_config                         = (sensitive value) -> null%0A      - kube_config_raw                     = (sensitive value) -> null%0A        name                                = "dev-velidaaks"%0A        tags                                = {%0A            "application" = "velidaaks"%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (33 unchanged attributes hidden)%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace has been deleted%0A  - resource "azurerm_monitor_workspace" "workspace" {%0A      - id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks" -> null%0A      - name                                = "dev-amw-velidaaks" -> null%0A        tags                                = {%0A            "application" = "velidaaks"%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role has been deleted%0A  - resource "azurerm_role_assignment" "role" {%0A      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks/providers/Microsoft.Authorization/roleAssignments/a80cd7f9-9a4c-c6fa-e1f9-e5f6acafbef1" -> null%0A        name                                   = "a80cd7f9-9a4c-c6fa-e1f9-e5f6acafbef1"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana has been deleted%0A  - resource "azurerm_dashboard_grafana" "grafana" {%0A      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/dev-grafana-velidaaks" -> null%0A        name                                   = "dev-grafana-velidaaks"%0A        tags                                   = {%0A            "application" = "velidaaks"%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (12 unchanged attributes hidden)%0A%0A      - identity {%0A          - principal_id = "faaef024-6b78-443e-80be-fe8e3a544721" -> null%0A            # (2 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.monitoring_data_reader_role.azurerm_role_assignment.role has been deleted%0A  - resource "azurerm_role_assignment" "role" {%0A      - id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/cbb566dd-8920-c644-1732-2e6e4b4233bf" -> null%0A        name                                   = "cbb566dd-8920-c644-1732-2e6e4b4233bf"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.ssh-key.azapi_resource.ssh_public_key has been deleted%0A  - resource "azapi_resource" "ssh_public_key" {%0A      - id                        = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie" -> null%0A        name                      = "sshtruecollie"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi has been deleted%0A  - resource "azurerm_user_assigned_identity" "msi" {%0A      - id                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks" -> null%0A        name                = "dev-uai-velidaaks"%0A      - principal_id        = "d6a7ec3c-2cb6-4a37-91fb-b3c9c83fff47" -> null%0A        tags                = {%0A            "application" = "velidaaks"%0A            "environment" = "dev"%0A            "owner"       = "willvelida"%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.azurerm_container_registry.acr will be created%0A  + resource "azurerm_container_registry" "acr" {%0A      + admin_enabled                 = false%0A      + admin_password                = (sensitive value)%0A      + admin_username                = (known after apply)%0A      + encryption                    = (known after apply)%0A      + export_policy_enabled         = true%0A      + id                            = (known after apply)%0A      + location                      = "australiaeast"%0A      + login_server                  = (known after apply)%0A      + name                          = "devacrvelidaaks"%0A      + network_rule_bypass_option    = "AzureServices"%0A      + network_rule_set              = (known after apply)%0A      + public_network_access_enabled = true%0A      + resource_group_name           = "rg-velidaaks"%0A      + retention_policy              = (known after apply)%0A      + sku                           = "Standard"%0A      + tags                          = {%0A          + "application" = "velidaaks"%0A          + "environment" = "dev"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A        }%0A      + trust_policy                  = (known after apply)%0A      + zone_redundancy_enabled       = false%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A    }%0A%0A  # module.acr_pull_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "AcrPull"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be created%0A  + resource "azurerm_kubernetes_cluster" "aks" {%0A      + api_server_authorized_ip_ranges     = (known after apply)%0A      + current_kubernetes_version          = (known after apply)%0A      + dns_prefix                          = "dev-velidaaks"%0A      + fqdn                                = (known after apply)%0A      + http_application_routing_zone_name  = (known after apply)%0A      + id                                  = (known after apply)%0A      + image_cleaner_enabled               = false%0A      + image_cleaner_interval_hours        = 48%0A      + kube_admin_config                   = (sensitive value)%0A      + kube_admin_config_raw               = (sensitive value)%0A      + kube_config                         = (sensitive value)%0A      + kube_config_raw                     = (sensitive value)%0A      + kubernetes_version                  = (known after apply)%0A      + location                            = "australiaeast"%0A      + name                                = "dev-velidaaks"%0A      + node_resource_group                 = (known after apply)%0A      + node_resource_group_id              = (known after apply)%0A      + oidc_issuer_url                     = (known after apply)%0A      + portal_fqdn                         = (known after apply)%0A      + private_cluster_enabled             = false%0A      + private_cluster_public_fqdn_enabled = false%0A      + private_dns_zone_id                 = (known after apply)%0A      + private_fqdn                        = (known after apply)%0A      + public_network_access_enabled       = true%0A      + resource_group_name                 = "rg-velidaaks"%0A      + role_based_access_control_enabled   = true%0A      + run_command_enabled                 = true%0A      + sku_tier                            = "Free"%0A      + support_plan                        = "KubernetesOfficial"%0A      + tags                                = {%0A          + "application" = "velidaaks"%0A          + "environment" = "dev"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A        }%0A      + workload_identity_enabled           = false%0A%0A      + api_server_access_profile (known after apply)%0A%0A      + auto_scaler_profile (known after apply)%0A%0A      + default_node_pool {%0A          + kubelet_disk_type    = (known after apply)%0A          + max_count            = 5%0A          + max_pods             = (known after apply)%0A          + min_count            = 1%0A          + name                 = "default"%0A          + node_count           = 3%0A          + node_labels          = (known after apply)%0A          + orchestrator_version = (known after apply)%0A          + os_disk_size_gb      = (known after apply)%0A          + os_disk_type         = "Managed"%0A          + os_sku               = (known after apply)%0A          + scale_down_mode      = "Delete"%0A          + type                 = "VirtualMachineScaleSets"%0A          + ultra_ssd_enabled    = false%0A          + vm_size              = "Standard_D2s_v3"%0A          + workload_runtime     = (known after apply)%0A        }%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + kubelet_identity (known after apply)%0A%0A      + linux_profile {%0A          + admin_username = "willvelida"%0A%0A          + ssh_key {%0A              + key_data = (known after apply)%0A            }%0A        }%0A%0A      + monitor_metrics {}%0A%0A      + network_profile {%0A          + dns_service_ip          = (known after apply)%0A          + docker_bridge_cidr      = (known after apply)%0A          + ebpf_data_plane         = (known after apply)%0A          + ip_versions             = (known after apply)%0A          + load_balancer_sku       = "standard"%0A          + network_data_plane      = (known after apply)%0A          + network_mode            = (known after apply)%0A          + network_plugin          = "kubenet"%0A          + network_policy          = (known after apply)%0A          + outbound_ip_address_ids = (known after apply)%0A          + outbound_ip_prefix_ids  = (known after apply)%0A          + outbound_type           = "loadBalancer"%0A          + pod_cidr                = (known after apply)%0A          + pod_cidrs               = (known after apply)%0A          + service_cidr            = (known after apply)%0A          + service_cidrs           = (known after apply)%0A%0A          + load_balancer_profile (known after apply)%0A%0A          + nat_gateway_profile (known after apply)%0A        }%0A%0A      + windows_profile (known after apply)%0A%0A      + workload_autoscaler_profile {%0A          + keda_enabled                              = true%0A          + vertical_pod_autoscaler_controlled_values = (known after apply)%0A          + vertical_pod_autoscaler_enabled           = false%0A          + vertical_pod_autoscaler_update_mode       = (known after apply)%0A        }%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be updated in-place%0A  ~ resource "azurerm_monitor_data_collection_rule" "dcr" {%0A        id                          = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks"%0A        name                        = "MSProm-australiaeast-dev-velidaaks"%0A        tags                        = {}%0A        # (6 unchanged attributes hidden)%0A%0A      ~ destinations {%0A          ~ monitor_account {%0A              ~ monitor_account_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/dev-amw-velidaaks" -> (known after apply)%0A                name               = "dev-amw-velidaaks"%0A            }%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created%0A  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {%0A      + data_collection_rule_id = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-dev-velidaaks"%0A      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"%0A      + id                      = (known after apply)%0A      + name                    = "dcra-dcr-prometheus-aks"%0A      + target_resource_id      = (known after apply)%0A    }%0A%0A  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created%0A  + resource "azurerm_monitor_workspace" "workspace" {%0A      + default_data_collection_endpoint_id = (known after apply)%0A      + default_data_collection_rule_id     = (known after apply)%0A      + id                                  = (known after apply)%0A      + location                            = "australiaeast"%0A      + name                                = "dev-amw-velidaaks"%0A      + public_network_access_enabled       = true%0A      + query_endpoint                      = (known after apply)%0A      + resource_group_name                 = "rg-velidaaks"%0A      + tags                                = {%0A          + "application" = "velidaaks"%0A          + "environment" = "dev"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A        }%0A    }%0A%0A  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created%0A  + resource "azurerm_kubernetes_cluster_extension" "ext" {%0A      + aks_assigned_identity = (known after apply)%0A      + cluster_id            = (known after apply)%0A      + current_version       = (known after apply)%0A      + extension_type        = "Microsoft.Dapr"%0A      + id                    = (known after apply)%0A      + name                  = "dapr"%0A      + release_namespace     = (known after apply)%0A      + release_train         = "Stable"%0A      + target_namespace      = (known after apply)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "6ef4778b-9110-4e3b-8390-6ab10d2f1607"%0A      + principal_type                   = "User"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Grafana Admin"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created%0A  + resource "azurerm_dashboard_grafana" "grafana" {%0A      + api_key_enabled                        = false%0A      + auto_generated_domain_name_label_scope = "TenantReuse"%0A      + deterministic_outbound_ip_enabled      = false%0A      + endpoint                               = (known after apply)%0A      + grafana_major_version                  = "10"%0A      + grafana_version                        = (known after apply)%0A      + id                                     = (known after apply)%0A      + location                               = "australiaeast"%0A      + name                                   = "dev-grafana-velidaaks"%0A      + outbound_ip                            = (known after apply)%0A      + public_network_access_enabled          = true%0A      + resource_group_name                    = "rg-velidaaks"%0A      + sku                                    = "Standard"%0A      + tags                                   = {%0A          + "application" = "velidaaks"%0A          + "environment" = "dev"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A        }%0A      + zone_redundancy_enabled                = false%0A%0A      + azure_monitor_workspace_integrations {%0A          + resource_id = (known after apply)%0A        }%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Monitoring Data Reader"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.network_contributor_role.azurerm_role_assignment.role must be replaced%0A-/+ resource "azurerm_role_assignment" "role" {%0A      ~ id                                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/25834415-b824-1ec4-16be-bd801e32fb23" -> (known after apply)%0A      ~ name                                   = "25834415-b824-1ec4-16be-bd801e32fb23" -> (known after apply)%0A      ~ principal_id                           = "d6a7ec3c-2cb6-4a37-91fb-b3c9c83fff47" -> (known after apply) # forces replacement%0A      ~ role_definition_id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)%0A      + skip_service_principal_aad_check       = (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.resource-group.azurerm_resource_group.rg will be updated in-place%0A  ~ resource "azurerm_resource_group" "rg" {%0A        id         = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks"%0A        name       = "rg-velidaaks"%0A      ~ tags       = {%0A            "application" = "velidaaks"%0A            "environment" = "dev"%0A          + "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A        }%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {%0A      + cluster_name        = "dev-velidaaks"%0A      + description         = "Kubernetes Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "australiaeast"%0A      + name                = "KubernetesRecordingRulesRuleGroup-dev-velidaaks"%0A      + resource_group_name = "rg-velidaaks"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_rss"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_cache"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_swap"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "deployment"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "daemonset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "statefulset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "job"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)%0A            EOT%0A          + record     = ":node_memory_MemAvailable_bytes:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)%0A            EOT%0A          + record     = "cluster:node_cpu:ratio_rate5m"%0A        }%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {%0A      + cluster_name        = "dev-velidaaks"%0A      + description         = "Node Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "australiaeast"%0A      + name                = "NodeRecordingRulesRuleGroup-dev-velidaaks"%0A      + resource_group_name = "rg-velidaaks"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})%0A            EOT%0A          + record     = "instance:node_num_cpu:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))%0A            EOT%0A          + record     = "instance:node_cpu_utilisation:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})%0A            EOT%0A          + record     = "instance:node_load1_per_cpu:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})%0A            EOT%0A          + record     = "instance:node_memory_utilisation:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_vmstat_pgmajfault{job="node"}[5m])%0A            EOT%0A          + record     = "instance:node_vmstat_pgmajfault:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"%0A        }%0A    }%0A%0A  # module.ssh-key.azapi_resource.ssh_public_key will be created%0A  + resource "azapi_resource" "ssh_public_key" {%0A      + body                      = jsonencode({})%0A      + id                        = (known after apply)%0A      + ignore_casing             = false%0A      + ignore_missing_property   = true%0A      + location                  = "australiaeast"%0A      + name                      = "sshtruecollie"%0A      + output                    = (known after apply)%0A      + parent_id                 = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks"%0A      + removing_special_chars    = false%0A      + schema_validation_enabled = true%0A      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"%0A    }%0A%0A  # module.ssh-key.azapi_resource_action.ssh_public_key_gen must be replaced%0A-/+ resource "azapi_resource_action" "ssh_public_key_gen" {%0A      ~ id                     = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie/generateKeyPair" -> (known after apply)%0A      ~ output                 = {%0A          - privateKey = <<-EOT%0A                -----BEGIN RSA PRIVATE KEY-----%0D%0A                MIIG5QIBAAKCAYEAryiF9IOVE/+/ps4134gHfk0Z/0yrs6A1384R343PG+PM/XYk%0D%0A                H8T6QfRCd5QADdoGwNYN0fAlMkam+1XSiDAGZWJTs5qwLA2NmMPWXw9so5wJaa1s%0D%0A                g+rT/BNJzfixkMt3Ryq9sHhlIGQk/n8xTWejuKs/2eIR9DENm4QhODhk10c/0ULC%0D%0A                MNYVreVj3LHaT+kVGXqpb5ADNNkENCLA9R6sqmhjLPQ6YNeKjU+CZmlX6sEt6pBh%0D%0A                59ezeAs6FhgF8puV5cHTFcs02izP/ytxLCUA2tD1TsjqG689e+25YWF9DmQhyfVx%0D%0A                /sbetQV8UDuza4Jn5gbOHaj/riiareZU/+lKh/uIydFJLpXz5rX+4EuVfNurOFAs%0D%0A                kxGQ9AxGrAB+dzp698/IQlz2LEg2ck5VBDfbozNhcbTACHKsv++ujI+bTGvKJaVc%0D%0A                DuUhS9/6gA8x3lfhwpd9illd6eUip1lb6/pOuj+AdgSYZFQ/SzO5Wu9l8ai4S437%0D%0A                AiyN2KbGegORk/zJAgMBAAECggGADN/MoME/Jt4oZwlHGmv0KQtfus0W3bgL3axW%0D%0A                0fipXWJsAcE6PH+M6WYbsJBXRK1ey7OwBltBUKWyxkxzkgD9p1wHzO60vjgszSqv%0D%0A                ygLnOEtSwcq2bCfJdwCv7wy1eHAMD1YL5TmkLTJPKcmNhSP1+6/SnKAqM6mbV2/p%0D%0A                xSkX+F7LSQVAIrjJlSOEKIeGBVObcmj6pTGPmsXMskxPpHShulC74WT+GXoeO+65%0D%0A                Je/eP2n9hv0fxRusnEku9srDPSbESYHdc9qATa8WXt2UOtBOUjb2of3BIx+fALAy%0D%0A                8EPjYC21u7axkR4GP6R0eoIQzEkWpC9O4wEEY5dhFPE930zPjIFLg6Ob792hUxTn%0D%0A                y4dXNlcxT5ewFEm/YfRAn/wl/6zuP920hDRh1oF0MID3E3f+V8h5SDh2iEucEbv1%0D%0A                M5J67GQ+41yR1AnNVBIgf42O4kkz6YxoFFLxSwbae6o2efONO/evtxyWmmw3vrju%0D%0A                nFLM6js3aHlctl78GYRwKEYMA88FAoHBAOfzYwRO6nRNd1F3hH3jstIan9irQQqp%0D%0A                4SU5C/Nj9SpD+0qPVwmajb+6tvrObnnH2+cXrcc06ViVZKhjsQrQxKif6WxDVf0G%0D%0A                EcQkAOvKLVEX+A871fzBvd3zelWJ4cUZt7Lc2LZzBcLItATY17PD2fAxwUWTgvHu%0D%0A                Noa+iqnXuT+2LCT8JfvwAU8CqqQ8zK9Ul8qw0SbEzH/rcf+xvLENT4nc3n1dafI5%0D%0A                g7q4XT4hM/ZTkNuSU6gTNYDWxfYhQvptmwKBwQDBUbVU0qSg5VlRmuNcAtomZ72F%0D%0A                nRh3Eoiyy6fuWFJe1UYLGDuZTpNNDOdLnoTAvCUlQSAbyU+lQHtApMT8ILcfCLcS%0D%0A                WPyg0VkW0CANGr6Md4+5XlVrU52IKmlecne3VwclfU4mTkZajH47OoVQ7YGhozyK%0D%0A                oqj8QZX8ZHtVlPC5eaeW7lfJ9K4oXbvCoMmi3VUx+MMz2tihSqf29qQp+JKWAMGa%0D%0A                drpt6lyY5V3aTI/H/Mr7PESs9+RM8TwoyE3B12sCgcEApQNhzg7WfScfW7XLbEQx%0D%0A                U4fdcCdlflCc+/45ok3afNcgT0rqgMqTTXNn+cYikkC9EQqndrEN0Rd3JNTHfwpG%0D%0A                3i/lwD+nTPqkaQW0IgsTcj27HBtVgRvUF7K/tVsCY1aIeZbkFeh+kLR4XXpm+ly7%0D%0A                D0ZWWUk4PyVZZULpIyt1fv37KdS4sSNtyuf6vh0DATkNRAXGxe38DoVR9LZdpxfx%0D%0A                HgMjxcxPMyP3sz62Fx1H+lY5F/xhx5Di32XsL845+C9BAoHBAJaIYYLjY35GGP8K%0D%0A                dPA46FXvggyA/4P40qknHGTkMX/W4uvQutft75WX7qNblFPgLayMwcvhPjuXsmHr%0D%0A                69fIQc/QoX2P/WfcnFq/RbXulWIb17aoVit0uL5HCDWbPM1u3wm6QRhi6zWnIMRO%0D%0A                FXGm/8I1sfbiImQLThdyxvclOy2yJWXJwmJoPRUBqCstuNUxNB3tb1L5nqY51ADi%0D%0A                nYJxJPPZMuhse08Lp38HW8WYyH0Zw5VOoMtvXD7tucKn9qRycQKBwQCxkAgmQhcv%0D%0A                mfTiYtLY5l6wE8pB/wL3Uq9dBBhc796wSg70utNWQVBrnorHkQEyzH+R7MnInYaU%0D%0A                7OVGGVckEDLbT8KL5R9+0ioFPmU9oeC2Xp6JDKojNNqh/IEifAeWaFBK04AYXj3j%0D%0A                G7vvqk4GGGE6sKjuX1WxB0BO1PFSYcQ25iAIZJyJLcwMvjXvUQ4pfUXhWinC2acp%0D%0A                DUc9gcspsCAumOZxoNEU9SSrbqGH3MsgQWjZ7htdoia/DFGnvBLj4BI=%0D%0A                -----END RSA PRIVATE KEY-----%0A            EOT%0A          - publicKey  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvKIX0g5UT/7+mzjXfiAd+TRn/TKuzoDXfzhHfjc8b48z9diQfxPpB9EJ3lAAN2gbA1g3R8CUyRqb7VdKIMAZlYlOzmrAsDY2Yw9ZfD2yjnAlprWyD6tP8E0nN+LGQy3dHKr2weGUgZCT+fzFNZ6O4qz/Z4hH0MQ2bhCE4OGTXRz/RQsIw1hWt5WPcsdpP6RUZeqlvkAM02QQ0IsD1HqyqaGMs9Dpg14qNT4JmaVfqwS3qkGHn17N4CzoWGAXym5XlwdMVyzTaLM//K3EsJQDa0PVOyOobrz177blhYX0OZCHJ9XH+xt61BXxQO7NrgmfmBs4dqP+uKJqt5lT/6UqH+4jJ0UkulfPmtf7gS5V826s4UCyTEZD0DEasAH53Onr3z8hCXPYsSDZyTlUEN9ujM2FxtMAIcqy/766Mj5tMa8olpVwO5SFL3/qADzHeV+HCl32KWV3p5SKnWVvr+k66P4B2BJhkVD9LM7la72XxqLhLjfsCLI3YpsZ6A5GT/Mk= generated-by-azure"%0A        } -> (known after apply)%0A      ~ resource_id            = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created%0A  + resource "azurerm_user_assigned_identity" "msi" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "australiaeast"%0A      + name                = "dev-uai-velidaaks"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "rg-velidaaks"%0A      + tags                = {%0A          + "application" = "velidaaks"%0A          + "environment" = "dev"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A        }%0A      + tenant_id           = (known after apply)%0A    }%0A%0APlan: 15 to add, 2 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  ~ kube_config         = (sensitive value)%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>